In [1]:
import os
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'from_to':['LoNDon_paris','MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis','Brussels_londOn']
                  ,'flightNumber':[10045,np.nan,10065,np.nan,10085]
                  ,'RecentDelays':[[23,47],[],[24,43,87],[13],[67,32]]
                  ,'Airline': ['KLM(!)','<Air France> (12)','(British Airways. )','12.Air France',"""Swis Air"""]})

In [3]:
df

            from_to  flightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]        12.Air France
4   Brussels_londOn       10085.0      [67, 32]             Swis Air

In [4]:
df["flightNumber"] = pd.to_numeric(df["flightNumber"])

In [5]:
df

            from_to  flightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]        12.Air France
4   Brussels_londOn       10085.0      [67, 32]             Swis Air

In [6]:
df.head(3)

            from_to  flightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )

In [7]:
df.columns

Index(['from_to', 'flightNumber', 'RecentDelays', 'Airline'], dtype='object')

In [8]:
df.dtypes

from_to          object
flightNumber    float64
RecentDelays     object
Airline          object
dtype: object

In [9]:
df.dtypes['flightNumber']

dtype('float64')

In [10]:
df['flightNumber'] = pd.to_numeric(df['flightNumber'], downcast='integer')

In [11]:
df.dtypes['flightNumber']

dtype('float64')

In [12]:
# df.astype({'flightNumber':int})

In [13]:
df

            from_to  flightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]        12.Air France
4   Brussels_londOn       10085.0      [67, 32]             Swis Air

In [14]:
df.fillna(value='fill_null')

            from_to flightNumber  RecentDelays              Airline
0      LoNDon_paris        10045      [23, 47]               KLM(!)
1      MAdrid_miLAN    fill_null            []    <Air France> (12)
2  londON_StockhOlm        10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis    fill_null          [13]        12.Air France
4   Brussels_londOn        10085      [67, 32]             Swis Air

In [15]:
#df.fillna(value = df['flightNumber'].mean())
df.loc[[1],['flightNumber']] = df.loc[[1],['flightNumber']].fillna(value = 10055)

In [16]:
df

            from_to  flightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]        12.Air France
4   Brussels_londOn       10085.0      [67, 32]             Swis Air

In [17]:
df.loc[[3],['flightNumber']] = df.loc[[3],['flightNumber']].fillna(value = 10075)

In [18]:
df

            from_to  flightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]        12.Air France
4   Brussels_londOn       10085.0      [67, 32]             Swis Air

In [19]:
df['flightNumber'] = pd.to_numeric(df['flightNumber'], downcast='integer')

In [20]:
df.dtypes['flightNumber']

dtype('int16')

In [21]:
df[["from",'to']] = df.from_to.str.split("_",expand = True)

In [22]:
df

,from_to,flightNumber,RecentDelays,Airline,from,to
0,LoNDon_paris,10045,"[23, 47]",KLM(!),LoNDon,paris
1,MAdrid_miLAN,10055,[],<Air France> (12),MAdrid,miLAN
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,Budapest_PaRis,10075,[13],12.Air France,Budapest,PaRis
4,Brussels_londOn,10085,"[67, 32]",Swis Air,Brussels,londOn

In [23]:
df.drop(['from','to'], axis = 1)

            from_to  flightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]        12.Air France
4   Brussels_londOn         10085      [67, 32]             Swis Air

In [24]:
df[["from",'to']] = df.from_to.str.split("_",expand = True)

In [25]:
df

,from_to,flightNumber,RecentDelays,Airline,from,to
0,LoNDon_paris,10045,"[23, 47]",KLM(!),LoNDon,paris
1,MAdrid_miLAN,10055,[],<Air France> (12),MAdrid,miLAN
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,Budapest_PaRis,10075,[13],12.Air France,Budapest,PaRis
4,Brussels_londOn,10085,"[67, 32]",Swis Air,Brussels,londOn

In [26]:
df.columns

Index(['from_to', 'flightNumber', 'RecentDelays', 'Airline', 'from', 'to'], dtype='object')

In [27]:
# df = df.drop([('from','to')],axis=1)

In [28]:
df = df.drop(['from_to'],axis=1)

In [29]:
df

   flightNumber  RecentDelays              Airline      from         to
0         10045      [23, 47]               KLM(!)    LoNDon      paris
1         10055            []    <Air France> (12)    MAdrid      miLAN
2         10065  [24, 43, 87]  (British Airways. )    londON  StockhOlm
3         10075          [13]        12.Air France  Budapest      PaRis
4         10085      [67, 32]             Swis Air  Brussels     londOn

In [30]:
df['from'] = df['from'].str.capitalize()

In [31]:
# df = df['to'].str.capilalize()

In [32]:
df['to'] = df['to'].str.capitalize()

In [33]:
df

   flightNumber  RecentDelays              Airline      from         to
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]        12.Air France  Budapest      Paris
4         10085      [67, 32]             Swis Air  Brussels     London

In [37]:
delays = pd.DataFrame({'Delay1' : ['23',np.nan,'24','13','67']
                     ,'Delay2' : ['47',np.nan,'43',np.nan,'32']
                     , 'Delay3' : [np.nan,np.nan,'87',np.nan,np.nan]})

In [38]:
delays

  Delay1 Delay2 Delay3
0     23     47    NaN
1    NaN    NaN    NaN
2     24     43     87
3     13    NaN    NaN
4     67     32    NaN

In [41]:
df= df.join(delays)

In [42]:
df

,flightNumber,RecentDelays,Airline,from,to,Delay1,Delay2,Delay3
0,10045,"[23, 47]",KLM(!),London,Paris,23,47,NaN
1,10055,[],<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm,24,43,87
3,10075,[13],12.Air France,Budapest,Paris,13,NaN,NaN
4,10085,"[67, 32]",Swis Air,Brussels,London,67,32,NaN

In [43]:
df = df.drop(['RecentDelays'],axis=1)

In [44]:
df

   flightNumber              Airline      from         to Delay1 Delay2 Delay3
0         10045               KLM(!)    London      Paris     23     47    NaN
1         10055    <Air France> (12)    Madrid      Milan    NaN    NaN    NaN
2         10065  (British Airways. )    London  Stockholm     24     43     87
3         10075        12.Air France  Budapest      Paris     13    NaN    NaN
4         10085             Swis Air  Brussels     London     67     32    NaN